In [13]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import sqlite3 as db

In [14]:
# Load data
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data")

# Add column headers
df.columns = ['age', 'workclass', 'fnlwgt', 'education', 'education_num', 'marital_status', 'occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country', 'income']

# Create sqladb
sqladb = db.connect('/Users/suruchi/Desktop/Personal/Aditya/Personal/Data Science/Acadgild/Assignment/12/sqladb')

#Creating database cursor for further querying the data
cursor = sqladb.cursor()

# Create table and load data
df.to_sql('Adult', sqladb, if_exists='replace', index=False)

In [15]:
# 1. Select 10 records from the adult sqladb
print("1. Select 10 records from the adult sqladb")
query = "SELECT * FROM Adult limit 10"
print(pd.read_sql_query(query,sqladb))

1. Select 10 records from the adult sqladb
   age          workclass  fnlwgt      education  education_num  \
0   50   Self-emp-not-inc   83311      Bachelors             13
1   38            Private  215646        HS-grad              9
2   53            Private  234721           11th              7
3   28            Private  338409      Bachelors             13
4   37            Private  284582        Masters             14
5   49            Private  160187            9th              5
6   52   Self-emp-not-inc  209642        HS-grad              9
7   31            Private   45781        Masters             14
8   42            Private  159449      Bachelors             13
9   37            Private  280464   Some-college             10

           marital_status          occupation    relationship    race  \
0      Married-civ-spouse     Exec-managerial         Husband   White
1                Divorced   Handlers-cleaners   Not-in-family   White
2      Married-civ-spouse   Handlers-cleaners         Husband   Black
3      Married-civ-spouse      Prof-specialty            Wife   Black
4      Married-civ-spouse     Exec-managerial            Wife   White
5   Married-spouse-absent       Other-service   Not-in-family   Black
6      Married-civ-spouse     Exec-managerial         Husband   White
7           Never-married      Prof-specialty   Not-in-family   White
8      Married-civ-spouse     Exec-managerial         Husband   White
9      Married-civ-spouse     Exec-managerial         Husband   Black

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male             0             0              13   United-States   <=50K
1     Male             0             0              40   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3   Female             0             0              40            Cuba   <=50K
4   Female             0             0              40   United-States   <=50K
5   Female             0             0              16         Jamaica   <=50K
6     Male             0             0              45   United-States    >50K
7   Female         14084             0              50   United-States    >50K
8     Male          5178             0              40   United-States    >50K
9     Male             0             0              80   United-States    >50K

In [16]:
# 2. Show me the average hours per week of all men who are working in private sector
print("\n2. Show me the average hours per week of all men who are working in private sector")
query = "SELECT sex,workclass, avg(hours_per_week) AverageHoursPerWeek FROM Adult where sex = 'Male' and workclass = 'Private'  group by sex,workclass"
print(pd.read_sql_query(query, sqladb))

2. Show me the average hours per week of all men who are working in private sector
Empty DataFrame
Columns: [sex, workclass, AverageHoursPerWeek]
Index: []

In [17]:
# 3. Show me the frequency table for education, occupation and relationship, separately
print("\n3. Show me the frequency table for education, occupation and relationship, separately")
print("\nFrequency table for education")
query = "SELECT  education, count(education) frequency from Adult group by education order by frequency desc "
print(pd.read_sql_query(query,sqladb))

3. Show me the frequency table for education, occupation and relationship, separately

Frequency table for education
        education  frequency
0         HS-grad      10501
1    Some-college       7291
2       Bachelors       5354
3         Masters       1723
4       Assoc-voc       1382
5            11th       1175
6      Assoc-acdm       1067
7            10th        933
8         7th-8th        646
9     Prof-school        576
10            9th        514
11           12th        433
12      Doctorate        413
13        5th-6th        333
14        1st-4th        168
15      Preschool         51

In [18]:
print("\nFrequency table for occupation")
query = "SELECT  occupation, count(occupation) frequency from Adult group by occupation order by frequency desc "
print(pd.read_sql_query(query,sqladb))

print("\nFrequency table for relationship")
query = "SELECT  relationship, count(relationship) frequency from Adult group by relationship order by frequency desc "
print(pd.read_sql_query(query,sqladb))

Frequency table for occupation
            occupation  frequency
0       Prof-specialty       4140
1         Craft-repair       4099
2      Exec-managerial       4066
3         Adm-clerical       3769
4                Sales       3650
5        Other-service       3295
6    Machine-op-inspct       2002
7                    ?       1843
8     Transport-moving       1597
9    Handlers-cleaners       1370
10     Farming-fishing        994
11        Tech-support        928
12     Protective-serv        649
13     Priv-house-serv        149
14        Armed-Forces          9

Frequency table for relationship
      relationship  frequency
0          Husband      13193
1    Not-in-family       8304
2        Own-child       5068
3        Unmarried       3446
4             Wife       1568
5   Other-relative        981

In [19]:
# 4. Are there any people who are married, working in private sector and having a masters degree
print("\n4. Are there any people who are married, working in private sector and having a masters degree")
query = """SELECT count(*) as People FROM Adult WHERE "marital_status" like "Married-%" AND workclass="Private" AND education="Masters" """
print(pd.read_sql_query(query,sqladb))

4. Are there any people who are married, working in private sector and having a masters degree
   People
0       0

In [20]:
# 5. What is the average, minimum and maximum age group for people working in different sectors
print("\n5. What is the average, minimum and maximum age group for people working in different sectors")
query = """SELECT workclass, avg(age) average, min(age) minimum, max(age) maximum FROM Adult GROUP BY workclass"""
print(pd.read_sql_query(query,sqladb))

5. What is the average, minimum and maximum age group for people working in different sectors
           workclass    average  minimum  maximum
0                  ?  40.960240       17       90
1        Federal-gov  42.590625       17       90
2          Local-gov  41.751075       17       90
3       Never-worked  20.571429       17       30
4            Private  36.797585       17       90
5       Self-emp-inc  46.017025       17       84
6   Self-emp-not-inc  44.969697       17       90
7          State-gov  39.436392       17       81
8        Without-pay  47.785714       19       72

In [21]:
# 6. Calculate age distribution by country
print("\n6. Calculate age distribution by country")
query = """SELECT native_country, Round(Round((count(age)*100),5)/Round((select COUNT(age) from Adult),5),5) as "Age Distribution"  FROM Adult group by native_country order by count(age) desc """
print(pd.read_sql_query(query,sqladb))

6. Calculate age distribution by country
                 native_country  Age Distribution
0                 United-States          89.58538
1                        Mexico           1.97482
2                             ?           1.79054
3                   Philippines           0.60811
4                       Germany           0.42076
5                        Canada           0.37162
6                   Puerto-Rico           0.35012
7                   El-Salvador           0.32555
8                         India           0.30713
9                          Cuba           0.29177
10                      England           0.27641
11                      Jamaica           0.24877
12                        South           0.24570
13                        China           0.23034
14                        Italy           0.22420
15           Dominican-Republic           0.21499
16                      Vietnam           0.20577
17                    Guatemala           0.19656
18                        Japan           0.19042
19                       Poland           0.18428
20                     Columbia           0.18120
21                       Taiwan           0.15663
22                        Haiti           0.13514
23                         Iran           0.13206
24                     Portugal           0.11364
25                    Nicaragua           0.10442
26                         Peru           0.09521
27                       France           0.08907
28                       Greece           0.08907
29                      Ecuador           0.08600
30                      Ireland           0.07371
31                         Hong           0.06143
32                     Cambodia           0.05835
33              Trinadad&Tobago           0.05835
34                         Laos           0.05528
35                     Thailand           0.05528
36                   Yugoslavia           0.04914
37   Outlying-US(Guam-USVI-etc)           0.04300
38                     Honduras           0.03993
39                      Hungary           0.03993
40                     Scotland           0.03686
41           Holand-Netherlands           0.00307

In [22]:
# 7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'
print("\n7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'")
query = """SELECT capital_gain as 'capital-gain', capital_loss as 'capital-loss', (capital_gain - capital_loss) as 'Net-Capital-Gain' FROM Adult """
print(pd.read_sql_query(query,sqladb))

7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'
       capital-gain  capital-loss  Net-Capital-Gain
0                 0             0                 0
1                 0             0                 0
2                 0             0                 0
3                 0             0                 0
4                 0             0                 0
5                 0             0                 0
6                 0             0                 0
7             14084             0             14084
8              5178             0              5178
9                 0             0                 0
10                0             0                 0
11                0             0                 0
12                0             0                 0
13                0             0                 0
14                0             0                 0
15                0             0                 0
16                0             0                 0
17                0             0                 0
18                0             0                 0
19                0             0                 0
20                0             0                 0
21                0             0                 0
22                0          2042             -2042
23                0             0                 0
24                0             0                 0
25                0             0                 0
26                0             0                 0
27                0             0                 0
28                0             0                 0
29                0             0                 0
...             ...           ...               ...
32530             0             0                 0
32531             0             0                 0
32532             0             0                 0
32533             0             0                 0
32534             0             0                 0
32535             0             0                 0
32536             0             0                 0
32537         15020             0             15020
32538             0             0                 0
32539             0             0                 0
32540             0             0                 0
32541             0             0                 0
32542             0             0                 0
32543             0             0                 0
32544             0             0                 0
32545             0             0                 0
32546             0             0                 0
32547          1086             0              1086
32548             0             0                 0
32549             0             0                 0
32550             0             0                 0
32551             0             0                 0
32552             0             0                 0
32553             0             0                 0
32554             0             0                 0
32555             0             0                 0
32556             0             0                 0
32557             0             0                 0
32558             0             0                 0
32559         15024             0             15024

[32560 rows x 3 columns]

In [23]:
sqladb.close()